jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_slave/src/fsl_dspi_slave_driver.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <string.h>
#include <assert.h>
#include "fsl_dspi_common.h"
#include "fsl_dspi_slave_driver.h"
#include "fsl_dspi_shared_function.h"
#include "fsl_clock_manager.h"
#include "fsl_interrupt_manager.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! SPI slave constants */
enum _spi_slave_constants
{
    kEmptyChar = 0,                        /*!< Empty character */
};

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief DSPI Slave Generic IRQ handler.
 *
 * This handler uses the callbacks stored in the dspi_slave_state_t struct to transfer data
 * either from the data source or to the data sink functions.
 * This is not a public API as it is called whenever an interrupt occurs.
 */
void DSPI_DRV_SlaveIRQHandler(uint32_t instance)
{
    /* instantiate local variable of type dspi_slave_state_t and equate it to the
     * pointer to state
     */
    dspi_slave_state_t * dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    /* Get the callback pointers from the run-time state structure */
    dspi_slave_callbacks_t * callbacks = &dspiState->callbacks;

    uint32_t sourceWord = kEmptyChar;
    uint8_t sourceWord1, sourceWord2, sourceWord3, sourceWord4;

    /* catch tx fifo underflow conditions, service only if tx under flow interrupt enabled */
    if ((DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxFifoUnderflow)) &&
        (DSPI_HAL_GetIntMode(baseAddr, kDspiTxFifoUnderflow)))
    {
        /* Report SPI slave transmit underrun error */
        if (callbacks->onError)
        {
            callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
        }
    }

    /* catch rx fifo overflow conditions, service only if rx over flow interrupt enabled */
    if ((DSPI_HAL_GetStatusFlag(baseAddr, kDspiRxFifoOverflow)) &&
        (DSPI_HAL_GetIntMode(baseAddr, kDspiRxFifoOverflow)))
    {
        /* Report SPI slave receive overflow error */
        if (callbacks->onError)
        {
            callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
        }
    }

    /* Architectural note: When developing the IRQ FIFO handling functionality, it was found that to
     * achieve more efficient run-time performance, it was better to first check the bits/frame
     * setting and then proceed with the FIFO fill/drain management process, rather than to clutter
     * the FIFO fill/drain process with continual checks of the bits/frame setting.
     */

    /* Optimize for 1 byte data */
    if (dspiState->bitsPerFrame <= 8)
    {
        /* SPI transmit interrupt (1 byte) */
        /* Fill the tx fifo, where the fifo can be 1 entry or more */
        while(DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxFifoFillRequest))
        {
            /* If a call back is provided, get data from there, else send kEmptyChar */
            if (callbacks->dataSource)
            {
                /* get the first 8-bits of data */
                if (callbacks->dataSource(&sourceWord1, instance) != kStatus_DSPI_Success)
                {
                    /* Report SPI slave transmit underrun error */
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
                    }
                }
                sourceWord = sourceWord1;
                /* Write the data to the DSPI data register */
                DSPI_HAL_WriteDataSlavemode(baseAddr, sourceWord);
            }
            else
            {
                /* If no callback provided, write empty char to data register */
                DSPI_HAL_WriteDataSlavemode(baseAddr, kEmptyChar);
            }
            /* try to clear TFFF by writing a one to it; it will not clear if TX FIFO not full */
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);
        }

        /* SPI receive interrupt (1 byte), read the data from the DSPI data register */
        /* Fill the rx fifo, where the fifo can be 1 entry or more */
        while (DSPI_HAL_GetStatusFlag(baseAddr, kDspiRxFifoDrainRequest))
        {
            /* SPI receive interrupt, read the data from the DSPI data register */
            uint32_t readData = DSPI_HAL_ReadData(baseAddr);

            /* clear the rx fifo drain request, needed for non-DMA applications as this flag
             * will remain set even if the rx fifo is empty. By manually clearing this flag, it
             * either remain clear if no more data is in the fifo, or it will set if there is
             * more data in the fifo.
             */
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoDrainRequest);

