jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_slave/src/fsl_dspi_slave_driver.c
            /* If callback provided, send data to it */
            if (callbacks->dataSink)
            {
                /* Sink the first 8-bits */
                if (callbacks->dataSink((uint8_t)readData, instance) != kStatus_DSPI_Success)
                {
                    // Report SPI receive overrun error
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
                    }
                }
            }
        }
    }
    /* Optimize for 2 bytes data */
    else if (dspiState->bitsPerFrame <= 16)
    {
        /* SPI transmit interrupt (2 bytes) */
        /* Fill the tx fifo, where the fifo can be 1 entry or more */
        while(DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxFifoFillRequest))
        {
            /* If a call back is provided, get data from there, else send kEmptyChar */
            if (callbacks->dataSource)
            {
                /* get the first 8-bits of data */
                if (callbacks->dataSource(&sourceWord1, instance) != kStatus_DSPI_Success)
                {
                    /* Report SPI slave transmit underrun error */
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
                    }
                }
                /* get the next 8-bits of data */
                if (callbacks->dataSource(&sourceWord2, instance) != kStatus_DSPI_Success)
                {
                    /* Report SPI slave transmit underrun error */
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
                    }
                }
                sourceWord = ((uint32_t)sourceWord2 << 8U) | sourceWord1;
                /* Finally, write the data to the DSPI data register */
                DSPI_HAL_WriteDataSlavemode(baseAddr, sourceWord);
            }
            else
            {
                /* If no callback provided, write empty char to data register */
                DSPI_HAL_WriteDataSlavemode(baseAddr, kEmptyChar);
            }
            /* try to clear TFFF by writing a one to it; it will not clear if TX FIFO not full */
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);
        }

        /* SPI receive interrupt (2 bytes), read the data from the DSPI data register */
        /* Fill the rx fifo, where the fifo can be 1 entry or more */
        while (DSPI_HAL_GetStatusFlag(baseAddr, kDspiRxFifoDrainRequest))
        {
            /* SPI receive interrupt, read the data from the DSPI data register */
            uint32_t readData = DSPI_HAL_ReadData(baseAddr);

            /* clear the rx fifo drain request, needed for non-DMA applications as this flag
             * will remain set even if the rx fifo is empty. By manually clearing this flag, it
             * either remain clear if no more data is in the fifo, or it will set if there is
             * more data in the fifo.
             */
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoDrainRequest);

            /* If callback provided, send data to it */
            if (callbacks->dataSink)
            {

                /* Sink the first 8-bits */
                if (callbacks->dataSink((uint8_t)readData, instance) != kStatus_DSPI_Success)
                {
                    // Report SPI receive overrun error
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
                    }
                }
                /* Sink the next 8-bits */
                if (callbacks->dataSink((uint8_t)(readData >> 8), instance) != kStatus_DSPI_Success)
                {
                    // Report SPI receive overrun error
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
                    }
                }
            }
        }
    }
    /* Optimize for 3 bytes data */
    else if (dspiState->bitsPerFrame <= 24)
    {
        /* SPI transmit interrupt (3 bytes) */
        /* Fill the tx fifo, where the fifo can be 1 entry or more */
        while(DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxFifoFillRequest))
        {
            /* If a call back is provided, get data from there, else send kEmptyChar */
            if (callbacks->dataSource)
            {
                /* get the first 8-bits of data */
                if (callbacks->dataSource(&sourceWord1, instance) != kStatus_DSPI_Success)
                {
                    /* Report SPI slave transmit underrun error */
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
                    }
                }
                /* get the next 8-bits of data */
                if (callbacks->dataSource(&sourceWord2, instance) != kStatus_DSPI_Success)
                {
                    /* Report SPI slave transmit underrun error */
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
                    }
                }
                /* get the next 8-bits of data */
                if (callbacks->dataSource(&sourceWord3, instance) != kStatus_DSPI_Success)
                {
                    /* Report SPI slave transmit underrun error */
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
                    }
                }
                sourceWord = ((uint32_t)sourceWord3 << 16U) | ((uint32_t)sourceWord2 << 8U) |
                             sourceWord1;
                /* Finally, write the data to the DSPI data register */
                DSPI_HAL_WriteDataSlavemode(baseAddr, sourceWord);
            }
            else
            {
                /* If no callback provided, write empty char to data register */
                DSPI_HAL_WriteDataSlavemode(baseAddr, kEmptyChar);
            }
            /* try to clear TFFF by writing a one to it; it will not clear if TX FIFO not full */
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);
        }

        /* SPI receive interrupt (3 bytes), read the data from the DSPI data register */
        /* Fill the rx fifo, where the fifo can be 1 entry or more */
        while (DSPI_HAL_GetStatusFlag(baseAddr, kDspiRxFifoDrainRequest))
        {
            /* SPI receive interrupt, read the data from the DSPI data register */
            uint32_t readData = DSPI_HAL_ReadData(baseAddr);

            /* clear the rx fifo drain request, needed for non-DMA applications as this flag
             * will remain set even if the rx fifo is empty. By manually clearing this flag, it
             * either remain clear if no more data is in the fifo, or it will set if there is
             * more data in the fifo.
             */
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoDrainRequest);

