jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_slave/src/fsl_dspi_slave_driver.c
            /* If callback provided, send data to it */
            if (callbacks->dataSink)
            {

                /* Sink the first 8-bits */
                if (callbacks->dataSink((uint8_t)readData, instance) != kStatus_DSPI_Success)
                {
                    // Report SPI receive overrun error
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
                    }
                }
                /* Sink the next 8-bits */
                if (callbacks->dataSink((uint8_t)(readData >> 8), instance) != kStatus_DSPI_Success)
                {
                    // Report SPI receive overrun error
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
                    }
                }
                /* Sink the next 8-bits */
                if (callbacks->dataSink((uint8_t)(readData >> 16), instance) !=
                    kStatus_DSPI_Success)
                {
                    // Report SPI receive overrun error
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
                    }
                }
            }
        }
    }
    /* Optimize for 4 bytes data */
    else
    {
        /* SPI transmit interrupt (4 bytes) */
        /* Fill the tx fifo, where the fifo can be 1 entry or more */
        while(DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxFifoFillRequest))
        {
            /* If a call back is provided, get data from there, else send kEmptyChar */
            if (callbacks->dataSource)
            {
                /* get the first 8-bits of data */
                if (callbacks->dataSource(&sourceWord1, instance) != kStatus_DSPI_Success)
                {
                    /* Report SPI slave transmit underrun error */
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
                    }
                }
                /* get the next 8-bits of data */
                if (callbacks->dataSource(&sourceWord2, instance) != kStatus_DSPI_Success)
                {
                    /* Report SPI slave transmit underrun error */
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
                    }
                }
                /* get the next 8-bits of data */
                if (callbacks->dataSource(&sourceWord3, instance) != kStatus_DSPI_Success)
                {
                    /* Report SPI slave transmit underrun error */
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
                    }
                }
                /* get the next 8-bits of data */
                if (callbacks->dataSource(&sourceWord4, instance) != kStatus_DSPI_Success)
                {
                    /* Report SPI slave transmit underrun error */
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveTxUnderrun, instance);
                    }
                }

                sourceWord = ((uint32_t)sourceWord4 << 24U) | ((uint32_t)sourceWord3 << 16U) |
                             ((uint32_t)sourceWord2 << 8U) | sourceWord1;
                /* Finally, write the data to the DSPI data register */
                DSPI_HAL_WriteDataSlavemode(baseAddr, sourceWord);
            }
            else
            {
                /* If no callback provided, write empty char to data register */
                DSPI_HAL_WriteDataSlavemode(baseAddr, kEmptyChar);
            }
            /* try to clear TFFF by writing a one to it; it will not clear if TX FIFO not full */
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);
        }

        /* SPI receive interrupt (4 bytes), read the data from the DSPI data register */
        /* Fill the rx fifo, where the fifo can be 1 entry or more */
        while (DSPI_HAL_GetStatusFlag(baseAddr, kDspiRxFifoDrainRequest))
        {
            /* SPI receive interrupt, read the data from the DSPI data register */
            uint32_t readData = DSPI_HAL_ReadData(baseAddr);

            /* clear the rx fifo drain request, needed for non-DMA applications as this flag
             * will remain set even if the rx fifo is empty. By manually clearing this flag, it
             * either remain clear if no more data is in the fifo, or it will set if there is
             * more data in the fifo.
             */
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoDrainRequest);

            /* If callback provided, send data to it */
            if (callbacks->dataSink)
            {

                /* Sink the first 8-bits */
                if (callbacks->dataSink((uint8_t)readData, instance) != kStatus_DSPI_Success)
                {
                    // Report SPI receive overrun error
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
                    }
                }
                /* Sink the next 8-bits */
                if (callbacks->dataSink((uint8_t)(readData >> 8), instance) != kStatus_DSPI_Success)
                {
                    // Report SPI receive overrun error
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
                    }
                }
                /* Sink the next 8-bits */
                if (callbacks->dataSink((uint8_t)(readData >> 16), instance) !=
                    kStatus_DSPI_Success)
                {
                    // Report SPI receive overrun error
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
                    }
                }
                /* Sink the next 8-bits */
                if (callbacks->dataSink((uint8_t)(readData >> 24), instance) !=
                    kStatus_DSPI_Success)
                {
                    // Report SPI receive overrun error
                    if (callbacks->onError)
                    {
                        callbacks->onError(kStatus_DSPI_SlaveRxOverrun, instance);
                    }
                }
            }
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveInit
 * Description   : Initialize a DSPI instance for slave mode operation.
 * This function saves the callbacks to the run-time state structure for later use in the
 * interrupt handler. It also ungates the clock to the DSPI module, initializes the DSPI
 * for slave mode, enables the module and corresponding interrupts. Once initialized, the
 * DSPI module is configured in slave mode and ready to receive data from a SPI master. The
 * following is an example of how to set up the dspi_slave_state_t and the dspi_slave_user_config_t
 * parameters and how to call the DSPI_DRV_SlaveInit function by passing in these parameters:
 *   instance = slaveInstance; <- the desired module instance number
 *   dspi_slave_state_t dspiSlaveState; <- the user simply allocates memory for this struct
 *   dspi_slave_user_config_t slaveUserConfig;
 *   slaveUserConfig.callbacks.dataSink = data_sink; <- set to user implementation of function
 *   slaveUserConfig.callbacks.dataSource = data_source; <- set to user implementation of function
 *   slaveUserConfig.callbacks.onError = on_error; <- set to user implementation of function
 *   slaveUserConfig.dataConfig.bitsPerFrame = 16; <- example, can be 4 to 32
 *   slaveUserConfig.dataConfig.clkPhase = kDspiClockPhase_FirstEdge; <- example setting
 *   slaveUserConfig.dataConfig.clkPolarity = kDspiClockPolarity_ActiveHigh; <- example setting
 *   DSPI_DRV_SlaveInit(slaveInstance, &slaveUserConfig, &dspiSlaveState);
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_SlaveInit(uint32_t instance,
                                 dspi_slave_state_t * dspiState,
                                 const dspi_slave_user_config_t * slaveConfig)
{
    assert(slaveConfig);
    assert(instance < HW_SPI_INSTANCE_COUNT);

    dspi_status_t errorCode = kStatus_DSPI_Success;
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    /* Clear the run-time state struct for this instance. */
    memset(dspiState, 0, sizeof(* dspiState));

    /* Save the application info. */
    dspiState->callbacks = slaveConfig->callbacks;

    /* configure the run-time state struct with the nubmer of bits/frame */
    dspiState->bitsPerFrame = slaveConfig->dataConfig.bitsPerFrame;

    /* Enable clock for DSPI */
    CLOCK_SYS_EnableSpiClock(instance);

    /* Reset the DSPI module, which also disables the DSPI module */
    DSPI_HAL_Init(baseAddr);

