jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_slave/src/fsl_dspi_slave_driver.c
    /* Set to slave mode.*/
    DSPI_HAL_SetMasterSlaveMode(baseAddr, kDspiSlave);

    errorCode = DSPI_HAL_SetDataFormat(baseAddr, kDspiCtar0, &slaveConfig->dataConfig);

    /* Enable fifo operation (regardless of FIFO depth) */
    DSPI_HAL_SetFifoCmd(baseAddr, true, true);

    /* DSPI system enable */
    DSPI_HAL_Enable(baseAddr);

    /* flush the fifos*/
    DSPI_HAL_SetFlushFifoCmd(baseAddr, true, true);

    /* Configure IRQ state structure, so irq handler can point to the correct state structure */
    g_dspiStatePtr[instance] = dspiState;

    /* TX FIFO Fill Flag (TFFF) request enable*/
    DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateIntReq, true);

    /* RX FIFO Drain request: RFDF_RE to enable RFDF interrupt */
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateIntReq, true);

    /* Enable interrupt error requests */
    /* TX FIFO underflow request enable*/
    DSPI_HAL_SetIntMode(baseAddr, kDspiTxFifoUnderflow, true);
    /* RX FIFO overflow request enable*/
    DSPI_HAL_SetIntMode(baseAddr, kDspiRxFifoOverflow, true);

    /* Clear the Tx FIFO Fill Flag (TFFF) status bit */
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);

    /* Start DSPI transfers, set to running state */
    DSPI_HAL_StartTransfer(baseAddr);

    /* Enable the interrupt */
    INT_SYS_EnableIRQ(g_dspiIrqId[instance]);

    return errorCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveDeinit
 * Description   : Shutdown a DSPI instance.
 * Resets the DSPI peripheral, disables the interrupt to the core, and gates its clock.
 *
 *END**************************************************************************/
void DSPI_DRV_SlaveDeinit(uint32_t instance)
{
    /* instantiate local variable of type dspi_slave_state_t and equate it to the
     * pointer to state
     */
    dspi_slave_state_t * dspiState = (dspi_slave_state_t *)g_dspiStatePtr[instance];
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    assert(instance < HW_SPI_INSTANCE_COUNT);

    /* disable the interrupt */
    INT_SYS_DisableIRQ(g_dspiIrqId[instance]);

    /* Stop the transfer process in the slave */
    DSPI_HAL_StopTransfer(baseAddr);

    /* Wait until the DSPI run status signals that is has halted before shutting
     * down the module and before gating off the DSPI clock source.  Otherwise, if the DSPI
     * is shut down before it has halted it's internal processes, it may be left in an unknown
     * state.
     * Note that if the master slave select is still asserted, the run status will never clear.
     * Hence, ensure before shutting down the slave that the master has de-asserted the slave
     * select signal (it should be high if slave select active low or it should be low if
     * slave select is active high).
     */
    while((DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxAndRxStatus))) { }

    /* Restore the module to defaults then power it down. This also disables the DSPI module. */
    DSPI_HAL_Init(baseAddr);

    /* Gate the clock for DSPI. */
    CLOCK_SYS_DisableSpiClock(instance);

    /* If DMA-based operations were enabled, then do the following */
    if (dspiState->useDma)
    {
        EDMA_DRV_ReleaseChannel(&dspiState->dmaRxFifo2RxBuff);
        EDMA_DRV_ReleaseChannel(&dspiState->dmaSrc2TxFifo);
    }

    /* Clear state pointer. */
    g_dspiStatePtr[instance] = NULL;
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

